{
    "courses": [
        {
            "courseId" : "c-1",
            "banner": "/assets/Courses/c-1.jpg",
            "title": "SmartDataScale: Intelligent Data Management for Large-Scale Scientific Research",
            "summary": "The SmartDataScale Project addresses the growing challenges of managing vast datasets generated by modern scientific research. This platform uses advanced data compression, partitioning strategies, and machine learning algorithms to optimize large-scale data storage and accessibility.",
            "skills": [
                "Python",
                "Java"
            ],
            "objective": [
                "Develop an intelligent data management platform for scientific research.",
                "Optimize data storage, processing, and accessibility.",
                "Leverage machine learning for efficient data handling."
            ],
            "outcome": [
                "Improve data accessibility and storage cost efficiency.",
                "Enable faster scientific discoveries by optimizing data management.",
                "Contribute to the sustainability of scientific research across disciplines."
            ],
            "coordinator": "Dr. Nur Al Hasan Haldar",
            "duration":"3 months",
            "startDate":"..."
        },
        {
            "courseId": "c-2",
            "banner": "/assets/Courses/c-2.jpg",
            "title": "UrbanFlow: Dynamic Urban Mobility Visualization Platform for Smart Public Transport Management",
            "summary": "UrbanFlow is a real-time, dynamic visualization platform for public transport management. It aims to improve traffic congestion, optimize public transit operations, and help urban planners by integrating data from multiple sources, including GPS-enabled public transport vehicles, traffic sensors, and commuter behavior analytics.",
            "skills": [
                "Python",
                "JavaScript",
                "Java"
            ],
            "objective": [
                "Develop a real-time, interactive dashboard for public transport management.",
                "Integrate real-time data sources to improve public transport efficiency.",
                "Enable predictive modeling for decision-making."
            ],
            "outcome": [
                "Enhance public transport efficiency and reduce congestion.",
                "Support sustainability goals by reducing the urban carbon footprint.",
                "Empower commuters with real-time information for smarter navigation."
            ],
            "coordinator": "Dr. Nur Al Hasan Haldar",
            "duration":"3 months",
            "startDate":"..."
        }
    ]
}